# Brewfile
# https://github.com/Homebrew/homebrew-bundle

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'
brew 'zsh-completions'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

# Install Binaries
brew 'ag'                   # https://github.com/ggreer/the_silver_searcher
brew 'elixir'               # http://elixir-lang.org/
brew 'git'
brew 'neovim/neovim/neovim' # https://neovim.io/
brew 'node'
brew 'rbenv'                # https://github.com/rbenv/rbenv
brew 'tmux'                 # https://tmux.github.io/
brew 'tree'
brew 'wget'

# Apps
cask 'aerial'
cask 'appcleaner'
cask 'caffeine'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'vlc'
cask 'iterm2'

# Fonts
cask 'font-hack'

