# Brewfile
# https://github.com/Homebrew/homebrew-bundle

# Make sure apps get installed in system Applications dir
cask_args appdir: '/Applications'

# Taps
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'caskroom/fonts'
tap 'homebrew/bundle'
tap 'homebrew/dupes'

# Install ZSH
brew 'zsh'

# Install GNU core utilities (those that come with OS X are outdated)
brew 'coreutils'

# Install GNU `find`, `locate`, `updatedb`, and `xargs`, g-prefixed
brew 'findutils'

# Install Bash 4
brew 'bash'

# Install more recent versions of some OS X tools
brew 'homebrew/dupes/grep'

brew 'ag'
brew 'git'
brew 'neovim/neovim/neovim'
brew 'node'
brew 'rbenv'
brew 'ruby-build'
brew 'tmux'
brew 'tree'
brew 'wget'
brew 'exercism'
brew 'elixir'
brew 'reattach-to-user-namespace'

# Apps
cask 'aerial'
cask 'appcleaner'
cask 'keepingyouawake'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'skype'
cask 'slack'
cask 'spotify'
cask 'sublime-text'
cask 'vlc'
cask 'iterm2'

# Fonts
cask 'font-hack'
cask 'font-mononoki'

