ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/git

ohmyzsh/ohmyzsh path:lib/compfix.zsh
ohmyzsh/ohmyzsh path:lib/completion.zsh
ohmyzsh/ohmyzsh path:lib/directories.zsh
ohmyzsh/ohmyzsh path:lib/git.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh
ohmyzsh/ohmyzsh path:lib/key-bindings.zsh

romkatv/powerlevel10k

zsh-users/zsh-syntax-highlighting kind:defer
# history-substring-search not needed — omz key-bindings.zsh provides up-line-or-beginning-search
zsh-users/zsh-completions
