ohmyzsh/ohmyzsh
ohmyzsh/ohmyzsh path:plugins/brew
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/kops
ohmyzsh/ohmyzsh path:plugins/kubectl

# https://github.com/ohmyzsh/ohmyzsh/tree/master/plugins/aws
# ohmyzsh/ohmyzsh path:plugins/aws

ohmyzsh/ohmyzsh path:lib/grep.zsh
ohmyzsh/ohmyzsh path:lib/directories.zsh
ohmyzsh/ohmyzsh path:lib/history.zsh

mafredri/zsh-async

# Kinda didn't like autosuggestions with following configs, so keep it disabled
zsh-users/zsh-completions
# zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting
zsh-users/zsh-history-substring-search

sindresorhus/pure
